app/Controllers/Guru.php

    public function index()
    {
        // pengecekan jika belum login
        if (!$this->auth->check()) {
            $redirectURL = session('redirect_url') ?? '/login';
            unset($_SESSION['redirect_url']);

            return redirect()->to($redirectURL);
        }
        //mendapatkan halaman dan untuk ngitung nomor di tabel
        $currentPage = $this->request->getVar('page_halaman') ? $this->request->getVar('page_halaman') : 1;

        //pencarian
        $cari = $this->request->getVar('cari');
        if ($cari) {
            $hasil = $this->model->search($cari);
        } else {
            $hasil = $this->model;
        }

        $data = [
            'judul' => 'Data Guru',
            // 'guru' => $this->model->getAllData()
            'guru' => $this->model->paginate('10', 'halaman'),
---
SELECT *
FROM `guru`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `guru`